Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ཤིན་ཏུ་བཟང་པོ་ལམ་སྟོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཏི་མུག་སྤངས་པ་དེ་ལ་ནི། །ལྗོན་པོའི་ལྕུག་མ་ཉི་ཤུ་སྙེད་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Subhadra, when the son of a guide, Offered twenty twigs To the thus-gone Ignorance Abandoned And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་མཆོག་ནི་ཤིང་རྟ་མཁན་གྱི་ཚེ། །བཅོམ་ལྡན་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕུང་པོ་དེའི། །གཙུག་ལག་ཁང་གི་སྒོ་དག་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnottama, when a chariot maker, Opened a monastic temple and offered it To the blessed, thus-gone Heap of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐུགས་ནི་ཤིན་ཏུ་གཞུངས་པ་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྡུ་བའི་བློ་ནི་མངའ་བ་དེ། །ལམ་སྲང་དག་ཏུ་གཤེགས་ཚེ་གོས་དག་བཏིང་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumedhas, when a cattle herder, Spread out fabrics when the thus-gone Master of Mental Composure Was proceeding along a road And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱ་མཚོས་བྱིན་ནི་མདུན་འདོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐལ་ལྡན་ཤིང་རྟ་ལ། །མེ་ཏོག་དག་གི་གཞལ་མེད་ཁང་པ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samudradatta, when a priest, Offered a floral palace To the thus-gone Chariot of the Fortunate And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་ཏོག་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པའི་མཐུ་རྩལ་ལ། །མོ་སྲན་གྲེའུ་འབྲུ་སྤར་གང་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmaketu, when a farmer, Scattered a handful of māṣa beans Before the thus-gone Power of the Truth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་གདུགས་ནིར་ཡུ་ཧ་ཀའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་གསུང་དེ་ལ། །བྱུག་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Somacchattra, when a gate guard, Offered ointments To the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་འཕྲོ་སྤོས་འཚོང་གྱུར་པའི་ཚེ། །བདེ་གཤེགས་ཕྱོགས་རྣམས་གཟིགས་པ་སངས་རྒྱས་ཀྱི། །གཙུག་ལག་ཁང་དག་སྤོས་ཀྱིས་བདུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arciṣmat, when an incense merchant, Perfumed the monastic temple Of the buddha, the well-gone Universal Vision, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་རྒྱལ་པོ་ནི། །རི་མོ་མཁན་ཚེ་བདེ་གཤེགས་སྟོབས་གསལ་དེའི། །སྒོ་གང་དག་ནི་རི་མོ་བྲིས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vimalarāja, when a painter, Made paintings on a gateway Of the well-gone Clear Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་གྲགས་པ་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པར་རྟོགས་བཟོད་ལ། །ཆོས་གོས་སྲ་བརྐྱང་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānakīrti, when a garment merchant, Offered kaṭhina robes To the thus-gone Acceptance of Certain Realization And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀུན་རྒྱལ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གདུགས་དེ་ལ། །རིན་ཆེན་སེ་མོ་དོ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Saṃjaya, when a merchant’s son, Offered jewel necklaces To the thus-gone Dharma Parasol And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་འོད་ནི་མཐིང་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚོགས་ཀྱིས་མི་ཐུབ་ལ། །མཐིང་ཕོར་གཅིག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇaprabha, when an indigo artisan, Offered an indigo capsule To the thus-gone Invincible Gathering And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་སྒྲོགས་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མེ་ཏོག་ལ། །སྐུ་རེགས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vighuṣṭaśabda, when a garment merchant, Offered belts To the thus-gone Divine Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་རྒྱས་ཕྱུགས་རྫིའི་དཔོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་པད་མ་ལ། །ཆུར་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pūrṇacandra, when a chief cattle herder, Offered yogurt To the thus-gone Divine Lotus And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་མའི་འོད་ཟེར་བྲམ་ཟེ་ཡི། །རྒྱ་མཚོའི་བུ་ཚེ་བདེ་གཤེགས་ཀུན་གཟིགས་ལ། །ཧི་དིམ་བ་ར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmaraśmi, when the son of a brahmin ruler, Offered hidimvara To the well-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་བཟང་པོ་སྣོད་སྤྱད་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་ལྡན་དེ་ལ་ནི། །འབྲས་དྲུས་སྙིམ་པ་གང་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suvrata, when a vessel maker, Offered handfuls of millet To the thus-gone Possessor of Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲོན་རྒྱལ་བཅའ་བ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་ཚོགས་ཅན་ལ། །སྣུམ་ཁུར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradīparāja, when a cook, Offered fried cakes To the thus-gone Possessor of the Gathered Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གློག་གི་ཏོག་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་ནི་དགོངས་པ་ལ། །ན་བཟའ་ཕྲུགས་གཅིག་ཅིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vidyutketu, when a captain, Offered a set of garments To the thus-gone Knower of the Meaning And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་རྒྱལ་པོ་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་རྒྱལ་པོ་ལ། །ཁྲུས་རྐྱེན་བུམ་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Raśmirāja, when a potter, Offered vessels for bathing To the thus-gone King of Marks And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐར་མཁན་ཚལ་གྱི་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་པད་མའི་ཞལ་དེ་ལ། །ལོ་མའི་གདིང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jyotiṣka, when a gardener, Offered mats of leaves To the thus-gone Lotus Face And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་རྫོགས་ནོར་བུ་འཚོང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྙན་པར་དགོངས་དེ་ལ། །རིན་པོ་ཆེ་ཡི་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Saṃpannakīrti, when a jewel merchant, Offered a jeweled canopy To the thus-gone Renowned Realization And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་སྙིང་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྗོན་པའི་རྒྱལ་མཚན་དེ་ལ་ནི། །དྲི་བསུང་ལྡན་པའི་སྐྱེད་མོས་ཚལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmagarbha, when a powerful universal monarch, Offered a fragrant park To the thus-gone Majestic Tree Banner And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱལ་ནི་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་དག་དེ་ལ་ནི། །རིན་ཆེན་གདུགས་ནི་བྱེ་བ་སྟོང་སྙེད་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣya, when a universal monarch, Offered ten billion jeweled parasols To the thus-gone Pure Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱན་མཛེས་གྲོང་དཔོན་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་མཐུ་རྩལ་ལ། །མེ་ལོང་དང་ནི་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Cārulocana, when the daughter of the head of a town, Offered a mirror and a canopy To the thus-gone Lion StrengthAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྙོག་པ་མེད་དོན་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚོགས་ཀྱི་གཙོ་དེ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anāvilārtha, when a forest guard, Offered toothsticks To the thus-gone Leader of the Gathering And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲག་ཤུལ་སྡེ་ནི་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོས་ངད་ཞིམ་པོ་ལ། །ཕྱག་དར་སྙིམ་པ་གང་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ugrasena, when a boy, Offered handfuls of refuse To the thus-gone Delightful Fragrance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་གཟི་བརྗིད་ལྕི་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་པས་བསྔགས་དེ་ལ། །ལྷུང་བཟེད་བཀྲུ་ཕྱིར་ལྕི་བའི་གོང་བུ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyatejas, when a cow dung seller, Offered cow dung for the cleaning of alms bowls To the thus-gone Praised by the Learned And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་རྩལ་ཅན་ནི་རྩྭ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་མུ་སྟེགས་ལ། །རྩྭ་ཁུར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vikrama, when a grass seller, Offered loads of grass To the thus-gone Merit Support And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐོགས་མེད་བློ་ནི་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་འོད་དེ་ལ། །མཚོན་ཆ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asaṅgamati, when a blacksmith, Offered weapons To the thus-gone Light of Insight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ལྷ་ནི་ལྕགས་མགར་གྱི། །ཁྱེའུ་ཡི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །ཡེ་ཤེས་གོ་ཆ་ལ་ནི་ཁབ་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhudeva, when a young blacksmith, Offered a needle To the thus-gone Armor of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་ཕུང་པོ་འདྲེག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མདངས་སྟོབས་སྐྱེ་བ་ཡི། །སྲེག་ཤང་དག་ཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānarāśi, when a barber, Offered a mendicant’s staff To the thus-gone Bright Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁ་ལོ་སྒྱུར་བ་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དྲག་ཤུལ་ལ། །མཆིལ་ལྷམ་རིམ་གཅིག་པ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sārathi, when a poor man, Offered shoes with a single lining To the thus-gone Fierce Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་མཚུངས་ནི་གྲོང་ཁྱེར་ན། །རྟེན་ཚེ་བདེ་གཤེགས་སངས་རྒྱས་དགྱེས་དེ་ལ། །མོན་སྲན་གྲེའུ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendrakalpa, when a city beggar, Scattered māṣa beans Before the well-gone Delighting in Buddhahood And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་ཏོག་ནི་རྒྱལ་གཙོ་ཡི། །ཁྱེའུ་ཡི་ཚེ་ན་བདེ་གཤེགས་གསལ་རྒྱལ་ལ། །མཆིལ་མའི་སྣོད་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpaketu, when a young chief of kings, Offered a spittoon To the thus-gone King of Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་འཛིན་ནི་འདྲེག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དགྱེས་པ་པོ། །བཅོམ་ལྡན་དེ་ཡི་སེན་མོ་བཅད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhula, when a barber, Cut the nails of the blessed Thus-gone Delighting in All And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྩི་སྨན་ཆེན་པོ་ཐགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་རྣམ་གནོན་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahauṣadhi, when a weaver, Offered woven tassels To the thus-gone Subjugator of Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱུ་སྐར་རྒྱལ་པོ་ཚོང་འདུས་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་ནི་ལེགས་པར་དགོངས་དེ་ལ། །བུམ་པ་མར་གྱིས་བཀང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nakṣatrarāja, when a market merchant, Offered pots filled with butter To the thus-gone Realization of the Meaning And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྨན་པའི་རྒྱལ་པོ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེན་པོ་དེ་ལ་ནི། །ལྷ་ཡི་ཁང་བཟངས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaidyarāja, when the son of a chief merchant, Offered heavenly mansions To the thus-gone Majestic Mountain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་གླང་པོ་འབྲུ་མར་གྱི། །མཁན་ཚེ་དེ་བཞིན་གཤེགས་པ་འཕགས་དུལ་ལ། །ཞབས་བསྐུ་བ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyahastin, when a maker of grain oil, Offered foot ointments To the thus-gone Superior Taming And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཅོད་མཛད་སྨད་འཚོང་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་པ་གསལ་དེ་ལ། །མེ་ལོང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Chedana, when the daughter of a prostitute, Offered mirrors To the thus-gone Clear Learning And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་གྲགས་རྒྱལ་པོའི་ཁྲུས་པ་ཡི། །ཁྱེའུ་ཚེ་བདེ་གཤེགས་བསྡུ་བའི་བློ་མངའ་ལ། །འདག་པའི་ཆལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vighuṣṭarāja, when a young bath attendant, Offered soaps To the thus-gone Knowledge of Gathering And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མའི་འོད་ཟེར་དགེ་སློང་དབྱར་གནས་པའི། །རིམ་གྲོ་པ་ཚེ་དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་པ། །དེ་ལ་ཁྲུས་ཆུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryaraśmi, when the attendant of a monk observing the rains retreat, Offered washing water To the thus-gone Beautiful Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་མཛོད་དཀའ་ཐུབ་ཅན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་ཆེན་གནས་སུ་ཕྱིན་པ་ལ། །མཚན་མོ་མར་མེ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmakośa, when an ascetic, Offered oil lamps for the night To the thus-gone Gone to the Abode of Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་བཟང་པོ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ང་རོ་ལ། །ཨ་རུ་ར་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumati, when a physician, Offered myrobalan fruits To the thus-gone Lion’s Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་དབང་མཚུངས་རྩྭ་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རིན་ཆེན་ལ། །བྷད་ཏྲ་ཀ་རི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇendrakalpa, when a straw collector, Offered bhadraka beans To the thus-gone Universal JewelAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྡོ་རྗེའི་སྡེ་ནི་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཀུན་དགའ་ལ། །ལྷུང་བཟེད་སྦྲང་རྩིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vajrasena, when a merchant, Offered an alms bowl filled with honey To the thus-gone Universal Joy for the World And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་བརྩེགས་ནི་རྔོན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྷར་ག་རྡོ་རྗེ་ཡི། །ལམ་སྲང་དག་ནི་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñākūṭa, when a hunter, Showed the way To the thus-gone Bhargavajra And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་གནས་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་དབྱངས་དེ་ལ། །བཻ་དཱུརྱ་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Susthita, when a brahmin, Offered a beryl parasol To the thus-gone Lion Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་སྦྱངས་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྐར་མའི་སྐབས་དེ་ལ། །སྣ་མའི་མེ་ཏོག་བདུན་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Cīrṇabuddhi, when a garland maker, Offered seven sumanā flowers To the thus-gone Star Opportunity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་དབྱངས་ལམ་སྟོན་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དེད་དཔོན་དེ་ལ་ནི། །གསེར་གྱི་མེ་ཏོག་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmaghoṣa, when a young guide, Scattered golden flowers Before the thus-gone Captain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་མཆོག་ནི་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མི་ཡི་ཟླ་བ་ལ། །བལ་སྲན་སྔོན་པོ་སྤར་གང་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇottama, when a farmer, Scattered a handful of blue beans Before the thus-gone Moon of Humanity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འབྲུག་སྒྲ་དབྱངས་ནི་རྩིས་པ་ཡི། །ཁྱེའུ་ཚེ་དེ་བཞིན་གཤེགས་པ་བཀོད་ཆེན་ལ། །ཕྲེང་བའི་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Garjitasvara, when a young astrologer, Offered flower garlands To the thus-gone Great Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མངོན་ཤེས་ཏོག་ནི་རིགས་གཙོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ལ། །དར་དང་བདུག་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhijñāketu, when the head of a great family, Offered silk and incense To the thus-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཏོག་འོད་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཛེས་དང་ལྡན་པ་དེའི། །ཞབས་གཉིས་དག་ནི་བཀྲུ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ketuprabha, when a prince, Washed both feet Of the thus-gone Endowed with Beauty And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགེ་བ་ཁྱིམ་བདག་ཚེ། །བདེ་གཤེགས་སྲིད་མཐའ་ནོར་བུའི་སྤོས་དེ་ལ། །དགུན་སྨད་སྦྱར་ཐུག་དག་ནི་གསོལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kṣema, when a householder, Offered pulse stew for the winter To the well-gone Jewel Fragrance of the End of Existence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་པ་མཐིང་བུ་འཚོང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞི་བར་གནས་དེ་ལ། །མཐིང་བུའི་ནོར་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmā, when a merchant of deep blue stones, Offered precious deep blue stones To the thus-gone Abiding in Peace And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེས་མཆོག་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་བསྡུས་དེ་ལ། །གུར་ཀུམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṃgava, when the son of a merchant, Offered saffron To the thus-gone Gathering of Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱན་སྡུག་སྤོས་འཚོང་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚངས་པས་མཆོད་དེ་ལ། །སྤོས་ཀྱི་ཕྱེ་མ་སྤར་གང་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitanetra, when a young incense merchant, Scattered a handful of fragrant powder Before the thus-gone Worshiped by Brahmā And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀླུས་སྦྱིན་རྫ་མཁན་ཆུང་མའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ང་རོ་ཆེན་པོ་ལ། །ཆུ་ཡིས་བཀང་བའི་སྣོད་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nāgadatta, when the wife of a potter, Offered vessels filled with water To the thus-gone Great Roar And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་ཏོག་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་དགྱེས་དེ་ལ། །གསེར་གྱི་ཁྲི་སྟན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyaketu, when a merchant, Offered golden thrones To the thus-gone Joyful Fame And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བརྒྱན་པ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་པ་གསལ་དེ་ལ། །སྤོས་ཀྱི་ཕུར་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Maṇḍita, when an incense merchant, Offered balls of incense To the thus-gone Clear Learning And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཞུམ་མེད་དབྱངས་ནི་ལྕགས་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྨོན་ལམ་མཐའ་ཡས་ལ། །ལྕགས་ལས་བྱས་པའི་སྣོད་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Adīnaghoṣa, when a blacksmith, Offered iron vessels To the thus-gone Infinite Aspiration And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འོད་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འགྲོ་བའི་འོད་ཟེར་ལ། །སྤོས་ཀྱི་རྡོ་གུ་དག་གིས་བདུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaprabha, when a captain, Burned fragrant pellets Before the thus-gone Radiance of the World And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་ནི་བྱིན་པ་ཡིས། །དེ་བཞིན་གཤེགས་པ་ལྟ་ན་བཟོད་དེ་ལ། །དཔྱིད་ཀ་ཆབ་རོམ་གོང་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ghoṣadatta, Offered a lump of ice in the spring To the thus-gone Acceptance upon Sight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེ་དག་ནི་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཆེན་པོ་ལ། །དེ་ལ་ཁབ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃha, when a blacksmith, Offered needles To the thus-gone Great Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་སྣ་ཚོགས་ཤ་ན་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསྒོམས་པའི་བདག་ཉིད་དེ་ལ་ནི། །ཤ་ན་དག་ལས་བྱས་པའི་ན་བཟའ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Citraraśmi, when a flax maker, Offered linen robes To the thus-gone Being of Meditation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་དཔའ་བོ་གྲོང་རྡལ་གྱི། །ཁྱེའུ་ཚེ་དེ་བཞིན་གཤེགས་པ་བློ་གསལ་ལ། །ལ་དུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaśūra, when a village boy, Offered laḍḍu To the thus-gone Clear Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་མའི་སྙིང་པོ་རྩིས་པ་ཡི། །ཁྱེའུ་ཚེ་དེ་བཞིན་གཤེགས་པ་མཁས་བློ་ལ། །མེ་ཏོག་སྙིམ་པ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmaskandha, when a young astrologer, Scattered handfuls of flowers Before the thus-gone Expert Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་རྒྱས་པ་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནོར་སྦྱིན་དེ་ལ་ནི། །དུས་མ་ཡིན་པར་བཅུད་ལྡན་བཏུང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpita, when a supervisor of a new building, Offered juice out of season To the thus-gone Gift of Jewels And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་རྩལ་སྟབས་ནི་རལ་པ་ཅན། །སྦྱིན་སྲེག་མཁན་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །ཞུམ་མེད་དབྱངས་ལ་ཞུགས་ལིང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vikrāntagamin, when a dreadlocked ascetic performing fire sacrifices, Offered a fire pot To the thus-gone Undaunted Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་ཕུང་པོ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་གཟིགས་དེ་ལ། །ལྷུང་བཟེད་སྦྲང་རྩིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyarāśi, when a merchant, Offered an alms bowl filled with honey To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.
